[
	{
		"name": "Spinosaurus",
		"image1": "images/spinosaurus.jpg",
		"image2": "./images/spinosaurus2.jpg",
		"alt1": "Spinosaurus roaring impressively",
		"alt2": "Spinosaurus swimming and hunting for prey",
		"content": [
            "Rad, sick, cool, and excellent are all words invented to describe the Spinosaurus. Even the name indicates something you do not want to mess with. I'm going to break down the top 5 reasons why Spinosaurus is cool.",
            "#1 Its the largest carivorous dinosaur ever Its even bigger than the hugely overated t-rex and gigantosaurs. Estimates suggest it could be up to 50-60 feet long and weigh around 7-10 tons-making it the largest known carnivorous dinosaur.",
            "#2 First Known Swimming Dinosaur Unlike most theropods, Spinosaurus was semi-aquatic! Fossil evidence suggests it spent much of its time hunting in rivers and lakes, making it the first confirmed swimming dinosaur. Making it the best of both worlds.",
            "#3 Giant Sail on Its Back Its most iconic feature was the massive sail (up to 7 feet tall), formed by elongated vertebrae. While its exact function is debated, it could have been used for display, thermoregulation, or intimidation—either way, it looked awesome.",
            "#4 A Crocodile-Like Skull Spinosaurus had a long, narrow snout filled with conical teeth, much like a modern crocodile. Crocdiles are cool, so therefore Spinosaurus is cool This adaptation made it perfect for catching slippery fish, reinforcing its semi-aquatic lifestyle.",
            "#5 Rivalry With T. rex (Pop Culture Icon Status) Thanks to its legendary fight with T. rex in Jurassic Park III (whether scientifically accurate or not), Spinosaurus has become one of the most recognizable dinosaurs in pop culture. That fight may have been controversial, but it cemented Spinosaurus as an absolute beast."
        ],
		"honorable-mentions": [
			"It Was a True Prehistoric Monster",
			"It Lived in an Epic Prehistoric Environment",
			"Unique Hunting Style",
			"Could Walk on Land & Swim in Water",
			"Webbed Feet & Paddle-Like Tail",
			"This edit exists and is awesome: <a href=\"https://www.youtube.com/shorts/frOjThVAOFo\">Sick Spinosaurus edit</a>"
		],
		"conclusion": "In conclusion, the Dilophosaurus was a cool dinosaur. It had the speed, intelligence, and looks to stand out from the crowd. Whether or not it actually spit venom (it didn’t), the legacy it left in pop culture is undeniable. Let me know if you disagree down below!"
	},
	{
		"name": "Dilophosaurus",
		"image1": "images/dilophosaurus.jpg",
		"image2": "images/dilophosaurus2.jpg",
		"alt1": "Dilophosaurus roaring impressively",
		"alt2": "Dilophosaurus feeds with another on a carcass",
		"content": [
            "Perhaps God had to take a break from making awesome stuff after creating the Dilophosaurus and thats why he made them exctint. They are just that cool. Read ahead to see the details why that is.",
            "#1 The Double-Crested King Dilophosaurus rocked not one, but two crests on its head, making it look like the prehistoric equivalent of a punk rock icon. While the exact function of these crests is debated, they were likely used for intimidation, display, or communication— all of which are undeniably rad.",
            "#2 One of the First Large Theropods Living during the Early Jurassic, Dilophosaurus was one of the first big carnivorous dinosaurs. At around 23 feet long and 900 lbs, it wasn’t the biggest predator of all time, but for its era, it was a terrifying apex predator that dominated the landscape.",
            "#3 Speed and Agility Over Brutality Unlike bulky, slow-moving predators, Dilophosaurus was fast and agile. Its lightweight frame, long legs, and sharp claws made it a swift hunter, likely able to chase down prey with ease. Think of it as the Jurassic Parkour master.",
            "#4 Its Jaw Was Built Differently Unlike many theropods with reinforced skulls, Dilophosaurus had a more flexible upper jaw. This likely helped it latch onto struggling prey and tear off chunks of flesh with precision. While some thought it had a weak bite, new research suggests it was more than capable of handling big meals.",
            "#5 Even cooler than the movies While the real Dilophosaurus didn’t have a frill or spit venom, its portrayal in Jurassic Park made it an instant legend. In reality the Dilophosaurus was even more terrifying. The shrimpy chicken sized dinosaur in the movie was actually 6 feet tall and 20 feet long in the Jurassic Park novel and actual history."
        ],
		"honorable-mentions": [
			"One of the Earliest True Theropods",
			"Possibly Hunted in Packs",
			"Lived in an Ancient, Exotic Jurassic World",
			"Its Skull Resembles a Dragon",
			"Its Name Literally Means Two-Crested Lizard"
		],
		"conclusion": "In conclusion, the Dilophosaurus was a cool dinosaur. It had the speed, intelligence, and looks to stand out from the crowd. Whether or not it actually spit venom (it didn’t), the legacy it left in pop culture is undeniable. Let me know if you disagree down below!"
	},
	{
		"name": "Allosaurus",
		"image1": "images/allosaurus.png",
		"image2": "images/allosaurus2.jpg",
		"alt1": "Allosaurus in all its glory",
		"alt2": "A group of Allosaurus roar together",
		"content": [
            "Allosaurus is an underrated legend. And one of my personal child hood favorite dinosaurs. So I will 100% take it personally if you disagree. So lets get into 5 reasons why Allosaurus is cool.",
            "#1 The Apex Predator of the Jurassic While T. rex ruled the late Cretaceous, Allosaurus was the undisputed king of the Jurassic period. At around 30-40 feet long and weighing up to 2.5 tons, this beast was the top predator of its time, taking down huge herbivores like Stegosaurus and Diplodocus. In comparison t-rex got up to 40 feet long. And Allosaurus had less of a wimpy arm problem.",
            "#2 A Mouth Full of Serrated Knives Allosaurus had razor-sharp, serrated teeth designed for slicing through flesh. Unlike T. rex, which crushed bones, Allosaurus used its teeth like a prehistoric steak knife, making it a terrifyingly efficient killer.",
            "#3 Its Hunting Style Was Absolutely Brutal Scientists believe Allosaurus used a \"hatchet bite\" technique—swinging its head down and tearing huge chunks out of prey. Some studies suggest its skull was flexible, allowing it to open its mouth insanely wide, like a snake, to take massive bites.",
            "#4 It Hunted in Packs (Maybe) Fossil evidence suggests that Allosaurus may have hunted in groups, making it one of the earliest examples of cooperative hunting. Imagine a pack of these 30-foot killers swarming a massive sauropod—pure nightmare fuel.",
            "#5 It’s Been in Almost Every Dinosaur Documentary Ever Whether it’s Walking with Dinosaurs, Dinosaur Revolution, or Prehistoric Planet, Allosaurus always gets the spotlight. It’s basically the rockstar of Jurassic carnivores, and for good reason. Although it is lesser known by the general public. Which is just dissapointing."
        ],
		"honorable-mentions": [
			"It Had Wickedly Long Claws for Slashing",
			"One of the Most Well-Preserved Dinosaur Fossils (\"Big Al\")",
			"Lived Alongside Some of the Most Famous Dinosaurs",
			"Had a Flexible Skull for Maximum Bite Efficiency",
			"Faster and More Agile Than a T. rex"
		],
		"conclusion": "In conclusion, the Allosaurus was a cool dinosaur. It was the apex predator of its era, had some of the most vicious hunting tactics, and honestly doesn’t get as much love as it deserves. Let me know if you disagree down below!"
	}
]
